# ---*--coding:utf-8 ---*--
#  可以作为标准物性数据库


# 定义参考态温度和压力，并规定该状态物质的焓和熵值为0

R = 8.314  # 理想气体常数
gl_Tref = 298.15  # unit: K
gl_Pref = 101325  # unit: Pa
Qe = 1.60218E-19  # 使用科学计数法
KB = 1.38065E-23  # Boltzmann Constant，常数首字符大写
PI = 3.14159265358979  # 一般使用功PI 或 Pai，首字符大写
NA = 6.02214 * 10 ** 23  # Avogadro Number

# 定义水蒸汽、氢气和氧气的基本物理性质
Pro_Cons = {
    "H2O": {
        "MW": 0.018015268,  # 相对分子质量 unit: kg/mol
        "Tc": 647.096,  # 临界温度 unit: K
        "Pc": 22064000.0,  # 临界压力 unit: Pa
        "Zc": 0.229,  # 偏心因子
        "Dc": 322.00000000000006,  # 临界密度, unit: kg/m3
        "Ttr": 273.16,  # 三相点温度 unit:K
        "Ptr": 611.6548008968684,  # 三相点压力 unit: Pa
        # 理想气体恒压热容参数(参数来自《化工热力学》)
        "Cp_ideal": [32.24, 1.908E-3, 1.057E-5, -3.602E-9],
        # 理想气体恒压热容参数(参数来自软件)
        "Cp_ideal_AP": [33.738112, -0.0070175634, 2.7296105E-05, -1.6646536E-08, 4.2976136E-12, -4.169608E-16],
        "Mu": [1.7096E-8, 1.1146, 0, 0],  # 气体黏度计算公式参数
        # 液体黏度系数计算公式参数
        "Mu_lq": [-52.843, 3703.6, 5.866, -5.879e-29, 10, 273.16, 646.15],
        "epsilon/k": 809.1,  # Lennard-Jones方程参数 unit: K
        "sigma": 2.641E-10,  # Lennard-Jones方程参数 unit: m
        "dip_mom": 1.8,  # 分子偶极矩 unit: Debye
        # Antoine方程参数
        "Antoine_constant": [73.649, -7258.2, 0, 0, -7.3037, 4.1653E-6, 2, 273.16, 647.1],
        # 汽化热计算公式参数
        "vaporization_constant": [40683.136, 373.2, 0.31064607, 0, 273.2],
        "Tb": 373.2,  # 正常沸点 unit: K
        "Vb": 19.63607,  # 饱和液体的摩尔体积 unit: cm3/mol
        # Pure38方法计算密度(单位mol/m3)参数
        "C_rho": [17863, 58606, -95396, 213890, -141260, 273.16, 647.1],
        "RKTZRA": 0.2431719,  # Rackett方程参数 ASPENPCD方法计算液体密度
        'Type': 0,  # 0液体分子，1强电解质，2气体分子
        'z': 0
    },
    "H2": {
        "MW": 0.00201588,  # unit: kg/mol
        "Tc": 33.145,  # unit: K
        "Pc": 1296400.0,  # unit: Pa
        "Zc": 0.305,
        "Dc": 31.262267039999998,  # unit: kg/m3
        "Ttr": 13.957,  # unit:K
        "Ptr": 7357.828141607672,  # unit: Pa
        "Cp_ideal": [28.36, 4.943E-3, -9.201E-6, 6.142E-9],
        "Cp_ideal_AP": [25.555306, 0.014820684, -2.25205E-05, 1.7676835E-08, -5.935131E-12, 7.1354169E-16],
        "Mu": [1.797E-7, 0.685, -0.59, 140],
        "epsilon/k": 59.7,  # unit: K
        "sigma": 2.827E-10,  # unit: m
        "dip_mom": 0,  # unit: Debye
        # 亨利系数计算公式参数
        # 无限稀释溶液中的标准生成焓(standard enthalpy of formation at infinite dilution) unit: J/mol
        "Henry_coefficient": [191.579, -6993.51, -26.3119, 0.0150431, 0, 274, 339],
        "DHAQFM": -4200,
        "Cp_inf": 0.58576,  # 无限稀释溶液中的比热容计算参数C Cp = C * T
        "Tb": 20.4,  # unit: K
        "Vb": 28.612729,  # cm3/mol
        "RKTZRA": 0.32011396,
        'Type': 2,
        'z': 0,
    },

    "O2": {
        "MW": 0.0319988,  # unit: kg/mol
        "Tc": 154.58100000000002,  # unit: K
        "Pc": 5043000.0,  # unit: Pa
        "Zc": 0.288,
        "Dc": 436.143644,  # unit: kg/m3
        "Ttr": 54.361,  # unit:K
        "Ptr": 146.27764705809653,  # unit: Pa
        "Cp_ideal": [28.66, -2.380E-3, 2.008E-5, -1.150E-8],
        "Cp_ideal_AP": [28.105988, -3.6801972E-06, 1.7458956E-05, -1.0651219E-08, 0, 0],
        "Mu": [1.101E-6, 0.5634, 96.3, 0],
        "epsilon/k": 106.7,  # unit: K
        "sigma": 3.467E-10,  # unit: m
        "dip_mom": 0,  # unit: Debye
        "Henry_coefficient": [155.921, -7775.06, -18.3974, -0.00944354, 0, 274, 348],
        "DHAQFM": -11700,  # unit: J/mol
        "Cp_inf": 0.464424,  # Cp = C * T
        "Tb": 90.2,  # unit: K
        "Vb": 27.873353,  # cm3/mol
        "RKTZRA": 0.28824663,
        'Type': 2,
        'z': 0

    },
    'KOH': {
        'MW': 0.0561056,  # unit: kg/mol
        'Tc': 2000,  # unit: K
        'Pc': 5000000,  # unit: Pa
        "Vca_infty": 0.00137372,  # 摩尔体积计算参数 unit: L/mol
        "Aca": 0.05213633,  # 黏度计算参数 unit: L/mol
        "Bca": {  # 黏度计算参数 对应单位：L/mol
            "K+": [-0.007, 0],
            "OH-": [0.12, 0],
        },
        "DHAQFM": {  # 离子在无限稀释溶液中的标准生成焓 unit: J/mol
            "K+": -252380,
            "OH-": -229994
        },
        "Cp_inf": {  # 无限稀释溶液中的比热容计算参数C Cp = C
            "K+": 21.8,
            "OH-": -148.5
        },
        'Type': 1,
    },
    'NaOH': {
        'MW': 0.04000,  # unit:kg/mol
        'Tc': 2000,
        'Pc': 5000000,
    },
    'K+': {
        'r': 1.498 * 10 ** (-10),  # unit:m
        'z': 1,
        'MW': 0.0390983,
    },
    'OH-': {
        'r': 2.17 * 10 ** (-10),  # unit:m
        'z': -1,
        'MW': 0.01700734,
    },
    'Na+': {
        'r': 1.68 * 10 ** (-10),
        'z': 1,
        'MW': 0.0229898,
    },
}

# eNRTL活度系数模型参数
eNRTLParameters = {
    'H2O': {
        'KOH': {
            'c': 0.2,
            'd': 0,
            'CCAM': -4.22942,
            'CMCA': 8.25791,
            'DCAM': -308.90561,
            'DMCA': 667.07415,
            'EMCA': -3.68912,
            'ECAM': 4.54074,
            'M': 0.0561056,  # unit:kg/mol
            'zc': 1,
            'rc': 2.17 * 10 ** (-10),  # unit:m
            'za': -1,
            'ra': 1.498 * 10 ** (-10),  # unit:m
        },
        'NaOH': {
            'c': 0.2,
            'd': 0,
            'CCAM': -3.73598,
            'CMCA': 6.96487,
            'DCAM': -480.32439,
            'DMCA': 1354.55985,
            'EMCA': 4.41215,
            'ECAM': 2.05258,
            'M': 0.04000,  # unit:kg/mol
            'zc': 1,
            'rc': 1.68 * 10 ** (-10),  # unit:m
            'za': -1,
            'ra': 1.498 * 10 ** (-10),  # unit:m
        }
    }
}

# 安托尼饱和蒸汽压参数
AntoineParameters = {
    'H2O': [73.649, -7258.2, 0, 0, -7.3037, 4.1653E-6, 2],
    'H2': [12.69, -94.896, 0, 0, 1.1125, 3.2915E-4, 2],
    'O2': [51.245, -1200.2, 0, 0, -6.4361, 0.28405, 1]
}
VolumeParameters = {
    'H2O': [18E-6, 0, 0, 0, 0],
    'H2': [25E-6, 0, 0, 0, 0],  # 25
    'O2': [35E-6, 0, 0, 0, 0],  # 32
}
# 亨利系数参数
HenryParameters = {
    'H2O': [0, 0, 0, 0, 0, 0],
    'H2': [191.579, -6993.51, -26.319, 0.0150431, 0, 274, 339],
    'O2': [155.921, -7775.06, -18.3974, -0.00944354, 0, 274, 348]
}

# Aspen中nrtl默认参数
aspen_nrtl_default = {
    'aij': 0,
    'bij': 0,
    'cij': 0.3,
    'dij': 0,
    'eij': 0,
    'fij': 0
}

#  nrtl模型参数，key= ('H2','O2'),类型
nrtl_params = {
    'aij': {
    },
    'aij': {},
    'bij': {},
    'cij': {},
    'dij': {},
    'eij': {},
    'fij': {},
}

# NRTL参数

ParamA = {'H2': {'H2': 0, 'O2': -0.7236088794183407, 'H2O': -3.559774993513047, 'K': 2.6805869523476757,
                 'OH': -7.9723709787974455},
          'O2': {'H2': -10.50008404675099, 'O2': 0, 'H2O': 0.207318121758356, 'K': -1.7814764190212056,
                 'OH': 7.993776207256709},
          'H2O': {'H2': 9.54673447266401, 'O2': 0.7428675150057675, 'H2O': 0, 'K': 16.332589844680367,
                  'OH': 2.886186612259551},
          'K': {'H2': 18.999663881546997, 'O2': -0.11654768855376553, 'H2O': -3.3187998279664566, 'K': 0,
                'OH': 0.057967602028178675},
          'OH': {'H2': 18.999688847646706, 'O2': -0.12282794241548545, 'H2O': -2.5708230780462187,
                 'K': -2.236583268587058, 'OH': 0}}

ParamB = {'H2': {'H2': 0, 'O2': -3163.7318494984097, 'H2O': 232.82082994632475, 'K': 643.4085191058726,
                 'OH': 385.3613745437003},
          'O2': {'H2': 1422.024479227183, 'O2': 0, 'H2O': -116.6106079512194, 'K': -485.36424330918044,
                 'OH': 52051.492380278185},
          'H2O': {'H2': -970.331985468085, 'O2': 46.824974844213564, 'H2O': 0, 'K': -2523.687475748067,
                  'OH': 159.72326132524753},
          'K': {'H2': -876.7614712446336, 'O2': -393.92092472011296, 'H2O': 215.6390105290923, 'K': 0,
                'OH': 117.65841748037752},
          'OH': {'H2': -876.7614712280852, 'O2': -913.5369928481031, 'H2O': -437.19171831727306,
                 'K': -1577.9305412302783, 'OH': 0}}
ParamD = {'H2': {'H2': 0.0, 'O2': -4.5433838912958215e-05, 'H2O': -1.9544346700777846e-05, 'K': 0.00024810647344253474,
                 'OH': -9.295028249066284e-05},
          'O2': {'H2': -0.0027695414430323004, 'O2': 0.0, 'H2O': -0.0018579388638697858, 'K': -0.00022816272343566165,
                 'OH': 1.9597450521028125e-13},
          'H2O': {'H2': -0.00019200162115338247, 'O2': 0.000958174972123226, 'H2O': 0.0, 'K': -0.0003849328444808218,
                  'OH': -7.721620096760995e-05},
          'K': {'H2': 0.0005959073260643459, 'O2': 0.0003408210683461497, 'H2O': -5.019899246540125e-05, 'K': 0.0,
                'OH': -2.7389092739055047e-05},
          'OH': {'H2': 0.0003859313341479137, 'O2': -0.0002496144439296132, 'H2O': -3.11198531427126e-05,
                 'K': 0.00013658591291115327, 'OH': 0.0}}

# 使用pydancti


# u.sigma = u.sigma
# class MyProp(BaseModel):

#     name: str =Field(title='名称',description='物质名称或化学式，要保持唯一性，后面使用物性用此名称作为key')
#     MW:float  = Field(title='分子量',description=f'单位：{u.kg/u.s}kg/mol')
